EthereumPhone/PQ1/docs/SE050/SE-PLUG-TRUST-MW_04.07.01/demos/ksdk/common/boards/lpc54018iotmodule/se_hostlib_examples/aws_jitr_demo_enet/pin_mux.h
/*
 * Copyright (c) 2016, Freescale Semiconductor, Inc.
 * Copyright 2016-2021 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

 /***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/***********************************************************************************************************************
 * Definitions
 **********************************************************************************************************************/

/*! @brief Direction type  */
typedef enum _pin_mux_direction
{
    kPIN_MUX_DirectionInput = 0U,        /* Input direction */
    kPIN_MUX_DirectionOutput = 1U,       /* Output direction */
    kPIN_MUX_DirectionInputOrOutput = 2U /* Input or output direction */
} pin_mux_direction_t;

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

#define PIO017_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO017_FUNC_ALT7 0x07u        /*!<@brief Selects pin function.: Alternative connection 7. */
#define PIO323_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO323_FUNC_ALT1 0x01u        /*!<@brief Selects pin function.: Alternative connection 1. */
#define PIO324_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO324_FUNC_ALT1 0x01u        /*!<@brief Selects pin function.: Alternative connection 1. */
#define PIO410_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO410_FUNC_ALT1 0x01u        /*!<@brief Selects pin function.: Alternative connection 1. */
#define PIO411_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO411_FUNC_ALT1 0x01u        /*!<@brief Selects pin function.: Alternative connection 1. */
#define PIO412_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO412_FUNC_ALT1 0x01u        /*!<@brief Selects pin function.: Alternative connection 1. */
#define PIO413_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO413_FUNC_ALT1 0x01u        /*!<@brief Selects pin function.: Alternative connection 1. */
#define PIO414_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO414_FUNC_ALT1 0x01u        /*!<@brief Selects pin function.: Alternative connection 1. */
#define PIO415_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO415_FUNC_ALT1 0x01u        /*!<@brief Selects pin function.: Alternative connection 1. */
#define PIO416_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO416_FUNC_ALT1 0x01u        /*!<@brief Selects pin function.: Alternative connection 1. */
#define PIO48_DIGIMODE_DIGITAL 0x01u  /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO48_FUNC_ALT1 0x01u         /*!<@brief Selects pin function.: Alternative connection 1. */

/*! @name FC2_CTS_SDA_SSEL0 (coord C2), J4[77/]P3_23-FC2_SDAX
  @{ */
#define BOARD_FC2_SDAX_PERIPHERAL FLEXCOMM2          /*!<@brief Device name: FLEXCOMM2 */
#define BOARD_FC2_SDAX_SIGNAL CTS_SDA_SSEL0          /*!<@brief FLEXCOMM2 signal: CTS_SDA_SSEL0 */
#define BOARD_FC2_SDAX_PIN_NAME FC2_CTS_SDA_SSEL0    /*!<@brief Pin name */
#define BOARD_FC2_SDAX_LABEL "J4[77/]P3_23-FC2_SDAX" /*!<@brief Label */
#define BOARD_FC2_SDAX_NAME "FC2_SDAX"               /*!<@brief Identifier name */
                                                     /* @} */

/*! @name FC2_RTS_SCL_SSEL1 (coord E2), J4[75]/P3_24-FC2_SCLX
  @{ */
#define BOARD_FC2_SCLX_PERIPHERAL FLEXCOMM2          /*!<@brief Device name: FLEXCOMM2 */
#define BOARD_FC2_SCLX_SIGNAL RTS_SCL_SSEL1          /*!<@brief FLEXCOMM2 signal: RTS_SCL_SSEL1 */
#define BOARD_FC2_SCLX_PIN_NAME FC2_RTS_SCL_SSEL1    /*!<@brief Pin name */
#define BOARD_FC2_SCLX_LABEL "J4[75]/P3_24-FC2_SCLX" /*!<@brief Label */
#define BOARD_FC2_SCLX_NAME "FC2_SCLX"               /*!<@brief Identifier name */
                                                     /* @} */

/*! @name ENET_TXD1 (coord E14), J3[45]/P0_17-ENET_TXD1
  @{ */
#define BOARD_ENET_TXD1_PERIPHERAL ENET                /*!<@brief Device name: ENET */
#define BOARD_ENET_TXD1_SIGNAL ENET_TXD                /*!<@brief ENET signal: ENET_TXD */
#define BOARD_ENET_TXD1_CHANNEL 1                      /*!<@brief ENET ENET_TXD channel: 1 */
#define BOARD_ENET_TXD1_PIN_NAME ENET_TXD1             /*!<@brief Pin name */
#define BOARD_ENET_TXD1_LABEL "J3[45]/P0_17-ENET_TXD1" /*!<@brief Label */
#define BOARD_ENET_TXD1_NAME "ENET_TXD1"               /*!<@brief Identifier name */
                                                       /* @} */

/*! @name ENET_RX_DV (coord B9), J3[74]/P4_10-ENET_CRS_DV
  @{ */
#define BOARD_ENET_CRS_DV_PERIPHERAL ENET                  /*!<@brief Device name: ENET */
#define BOARD_ENET_CRS_DV_SIGNAL ENET_RX_DV                /*!<@brief ENET signal: ENET_RX_DV */
#define BOARD_ENET_CRS_DV_PIN_NAME ENET_RX_DV              /*!<@brief Pin name */
#define BOARD_ENET_CRS_DV_LABEL "J3[74]/P4_10-ENET_CRS_DV" /*!<@brief Label */
#define BOARD_ENET_CRS_DV_NAME "ENET_CRS_DV"               /*!<@brief Identifier name */
                                                           /* @} */

/*! @name ENET_RXD1 (coord A6), J3[78]P4_12-ENET_RXD1
  @{ */
#define BOARD_ENET_RXD1_PERIPHERAL ENET               /*!<@brief Device name: ENET */
#define BOARD_ENET_RXD1_SIGNAL ENET_RXD               /*!<@brief ENET signal: ENET_RXD */
#define BOARD_ENET_RXD1_CHANNEL 1                     /*!<@brief ENET ENET_RXD channel: 1 */
#define BOARD_ENET_RXD1_PIN_NAME ENET_RXD1            /*!<@brief Pin name */
#define BOARD_ENET_RXD1_LABEL "J3[78]P4_12-ENET_RXD1" /*!<@brief Label */
#define BOARD_ENET_RXD1_NAME "ENET_RXD1"              /*!<@brief Identifier name */
                                                      /* @} */

/*! @name ENET_TX_EN (coord B6), J3[80]P4_13-ENET_TX_EN
  @{ */
#define BOARD_ENET_TX_EN_PERIPHERAL ENET                /*!<@brief Device name: ENET */
#define BOARD_ENET_TX_EN_SIGNAL ENET_TX_EN              /*!<@brief ENET signal: ENET_TX_EN */
#define BOARD_ENET_TX_EN_PIN_NAME ENET_TX_EN            /*!<@brief Pin name */
#define BOARD_ENET_TX_EN_LABEL "J3[80]P4_13-ENET_TX_EN" /*!<@brief Label */
#define BOARD_ENET_TX_EN_NAME "ENET_TX_EN"              /*!<@brief Identifier name */
                                                        /* @} */

/*! @name ENET_RX_CLK (coord B5), J3[82]/P4_14-ENET_RX_CLK
  @{ */
#define BOARD_ENET_RX_CLK_PERIPHERAL ENET                  /*!<@brief Device name: ENET */
#define BOARD_ENET_RX_CLK_SIGNAL ENET_RX_CLK               /*!<@brief ENET signal: ENET_RX_CLK */
#define BOARD_ENET_RX_CLK_PIN_NAME ENET_RX_CLK             /*!<@brief Pin name */
#define BOARD_ENET_RX_CLK_LABEL "J3[82]/P4_14-ENET_RX_CLK" /*!<@brief Label */
#define BOARD_ENET_RX_CLK_NAME "ENET_RX_CLK"               /*!<@brief Identifier name */
                                                           /* @} */

/*! @name ENET_MDC (coord A4), J3[84]/P4_15-ENET_MDC
  @{ */
#define BOARD_ENET_MDC_PERIPHERAL ENET               /*!<@brief Device name: ENET */
#define BOARD_ENET_MDC_SIGNAL ENET_MDC               /*!<@brief ENET signal: ENET_MDC */
#define BOARD_ENET_MDC_PIN_NAME ENET_MDC             /*!<@brief Pin name */
#define BOARD_ENET_MDC_LABEL "J3[84]/P4_15-ENET_MDC" /*!<@brief Label */
#define BOARD_ENET_MDC_NAME "ENET_MDC"               /*!<@brief Identifier name */
                                                     /* @} */

/*! @name ENET_MDIO (coord C4), J3[86]/P4_16-ENET_MDIO
  @{ */
#define BOARD_ENET_MDIO_PERIPHERAL ENET                /*!<@brief Device name: ENET */
#define BOARD_ENET_MDIO_SIGNAL ENET_MDIO               /*!<@brief ENET signal: ENET_MDIO */
#define BOARD_ENET_MDIO_PIN_NAME ENET_MDIO             /*!<@brief Pin name */
#define BOARD_ENET_MDIO_LABEL "J3[86]/P4_16-ENET_MDIO" /*!<@brief Label */
#define BOARD_ENET_MDIO_NAME "ENET_MDIO"               /*!<@brief Identifier name */
                                                       /* @} */

/*! @name ENET_TXD0 (coord B14), J3[72]/P4_8-ENET_TXD0
  @{ */
#define BOARD_ENET_TXD0_PERIPHERAL ENET               /*!<@brief Device name: ENET */
#define BOARD_ENET_TXD0_SIGNAL ENET_TXD               /*!<@brief ENET signal: ENET_TXD */
#define BOARD_ENET_TXD0_CHANNEL 0                     /*!<@brief ENET ENET_TXD channel: 0 */
#define BOARD_ENET_TXD0_PIN_NAME ENET_TXD0            /*!<@brief Pin name */
#define BOARD_ENET_TXD0_LABEL "J3[72]/P4_8-ENET_TXD0" /*!<@brief Label */
#define BOARD_ENET_TXD0_NAME "ENET_TXD0"              /*!<@brief Identifier name */
                                                      /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void); /* Function assigned for the Cortex-M4F */

