EthereumPhone/PQ1/docs/SE050/SE-PLUG-TRUST-MW_04.07.01/demos/ksdk/common/boards/lpc54018iotmodule/se_hostlib_examples/aws_jitr_demo_enet/pin_mux.h
#define PIO023_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO023_FUNC_ALT6 0x06u        /*!<@brief Selects pin function.: Alternative connection 6. */
#define PIO024_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO024_FUNC_ALT6 0x06u        /*!<@brief Selects pin function.: Alternative connection 6. */
#define PIO025_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO025_FUNC_ALT6 0x06u        /*!<@brief Selects pin function.: Alternative connection 6. */
#define PIO026_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO026_FUNC_ALT6 0x06u        /*!<@brief Selects pin function.: Alternative connection 6. */
#define PIO027_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO027_FUNC_ALT6 0x06u        /*!<@brief Selects pin function.: Alternative connection 6. */
#define PIO028_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO028_FUNC_ALT6 0x06u        /*!<@brief Selects pin function.: Alternative connection 6. */
#define PIO212_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO212_FUNC_ALT0 0x00u        /*!<@brief Selects pin function.: Alternative connection 0. */

/*! @name SPIFI_CLK (coord M13), U20[6]/P0_26-SPIFI_CLK
  @{ */
#define BOARD_SPIFI_CLK_PERIPHERAL SPIFI0              /*!<@brief Device name: SPIFI0 */
#define BOARD_SPIFI_CLK_SIGNAL SPIFI_SCK               /*!<@brief SPIFI0 signal: SPIFI_SCK */
#define BOARD_SPIFI_CLK_PIN_NAME SPIFI_CLK             /*!<@brief Pin name */
#define BOARD_SPIFI_CLK_LABEL "U20[6]/P0_26-SPIFI_CLK" /*!<@brief Label */
#define BOARD_SPIFI_CLK_NAME "SPIFI_CLK"               /*!<@brief Identifier name */
                                                       /* @} */

/*! @name SPIFI_IO(0) (coord M7), U20[5]/P0_24-SPIFI_IO0
  @{ */
#define BOARD_SPIFI_IO0_PERIPHERAL SPIFI0              /*!<@brief Device name: SPIFI0 */
#define BOARD_SPIFI_IO0_SIGNAL SPIFI_IO0/SPIFI_MOSI    /*!<@brief SPIFI0 signal: SPIFI_IO0/SPIFI_MOSI */
#define BOARD_SPIFI_IO0_PIN_NAME SPIFI_IO(0)           /*!<@brief Pin name */
#define BOARD_SPIFI_IO0_LABEL "U20[5]/P0_24-SPIFI_IO0" /*!<@brief Label */
#define BOARD_SPIFI_IO0_NAME "SPIFI_IO0"               /*!<@brief Identifier name */
                                                       /* @} */

/*! @name SPIFI_IO(1) (coord K8), U20[2]/P0_25-SPIFI_IO1
  @{ */
#define BOARD_SPIFI_IO1_PERIPHERAL SPIFI0              /*!<@brief Device name: SPIFI0 */
#define BOARD_SPIFI_IO1_SIGNAL SPIFI_IO1/SPIFI_MISO    /*!<@brief SPIFI0 signal: SPIFI_IO1/SPIFI_MISO */
#define BOARD_SPIFI_IO1_PIN_NAME SPIFI_IO(1)           /*!<@brief Pin name */
#define BOARD_SPIFI_IO1_LABEL "U20[2]/P0_25-SPIFI_IO1" /*!<@brief Label */
#define BOARD_SPIFI_IO1_NAME "SPIFI_IO1"               /*!<@brief Identifier name */
                                                       /* @} */

/*! @name SPIFI_IO(3) (coord L9), U20[7]/P0_27-SPIFI_IO3
  @{ */
#define BOARD_SPIFI_IO3_PERIPHERAL SPIFI0              /*!<@brief Device name: SPIFI0 */
#define BOARD_SPIFI_IO3_SIGNAL SPIFI_IO                /*!<@brief SPIFI0 signal: SPIFI_IO */
#define BOARD_SPIFI_IO3_CHANNEL 3                      /*!<@brief SPIFI0 SPIFI_IO channel: 3 */
#define BOARD_SPIFI_IO3_PIN_NAME SPIFI_IO(3)           /*!<@brief Pin name */
#define BOARD_SPIFI_IO3_LABEL "U20[7]/P0_27-SPIFI_IO3" /*!<@brief Label */
#define BOARD_SPIFI_IO3_NAME "SPIFI_IO3"               /*!<@brief Identifier name */
                                                       /* @} */

/*! @name SPIFI_IO(2) (coord M9), U20[3]/P0_28-SPIFI_IO2-USB0_OCURRn
  @{ */
#define BOARD_SPIFI_IO2_PERIPHERAL SPIFI0                          /*!<@brief Device name: SPIFI0 */
#define BOARD_SPIFI_IO2_SIGNAL SPIFI_IO                            /*!<@brief SPIFI0 signal: SPIFI_IO */
#define BOARD_SPIFI_IO2_CHANNEL 2                                  /*!<@brief SPIFI0 SPIFI_IO channel: 2 */
#define BOARD_SPIFI_IO2_PIN_NAME SPIFI_IO(2)                       /*!<@brief Pin name */
#define BOARD_SPIFI_IO2_LABEL "U20[3]/P0_28-SPIFI_IO2-USB0_OCURRn" /*!<@brief Label */
#define BOARD_SPIFI_IO2_NAME "SPIFI_IO2"                           /*!<@brief Identifier name */
                                                                   /* @} */

/*! @name SPIFI_CSN (coord N7), U20[1]/P0_23-SPIFI_CSn-MCLK
  @{ */
#define BOARD_SPIFI_CSn_PERIPHERAL SPIFI0                   /*!<@brief Device name: SPIFI0 */
#define BOARD_SPIFI_CSn_SIGNAL SPIFI_CSN                    /*!<@brief SPIFI0 signal: SPIFI_CSN */
#define BOARD_SPIFI_CSn_PIN_NAME SPIFI_CSN                  /*!<@brief Pin name */
#define BOARD_SPIFI_CSn_LABEL "U20[1]/P0_23-SPIFI_CSn-MCLK" /*!<@brief Label */
#define BOARD_SPIFI_CSn_NAME "SPIFI_CSn"                    /*!<@brief Identifier name */
                                                            /* @} */

/*! @name PIO2_12 (coord M2), J4[28]/P2_12-SPIFI_RSTn
  @{ */
#define BOARD_SPIFI_RSTn_PERIPHERAL GPIO                 /*!<@brief Device name: GPIO */
#define BOARD_SPIFI_RSTn_SIGNAL PIO2                     /*!<@brief GPIO signal: PIO2 */
#define BOARD_SPIFI_RSTn_GPIO GPIO                       /*!<@brief GPIO device name: GPIO */
#define BOARD_SPIFI_RSTn_GPIO_PIN 12U                    /*!<@brief PIO2 pin index: 12 */
#define BOARD_SPIFI_RSTn_PORT 2U                         /*!<@brief PORT device name: 2U */
#define BOARD_SPIFI_RSTn_PIN 12U                         /*!<@brief 2U pin index: 12 */
#define BOARD_SPIFI_RSTn_CHANNEL 12                      /*!<@brief GPIO PIO2 channel: 12 */
#define BOARD_SPIFI_RSTn_PIN_NAME PIO2_12                /*!<@brief Pin name */
#define BOARD_SPIFI_RSTn_LABEL "J4[28]/P2_12-SPIFI_RSTn" /*!<@brief Label */
#define BOARD_SPIFI_RSTn_NAME "SPIFI_RSTn"               /*!<@brief Identifier name */
                                                         /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitQSPI_FLASH(void); /* Function assigned for the Cortex-M4F */

#define PIO015_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO015_FUNC_ALT6 0x06u        /*!<@brief Selects pin function.: Alternative connection 6. */
#define PIO018_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO018_FUNC_ALT6 0x06u        /*!<@brief Selects pin function.: Alternative connection 6. */
#define PIO019_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO019_FUNC_ALT6 0x06u        /*!<@brief Selects pin function.: Alternative connection 6. */
#define PIO020_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO020_FUNC_ALT6 0x06u        /*!<@brief Selects pin function.: Alternative connection 6. */
#define PIO021_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO021_FUNC_ALT6 0x06u        /*!<@brief Selects pin function.: Alternative connection 6. */
#define PIO02_DIGIMODE_DIGITAL 0x01u  /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO02_FUNC_ALT6 0x06u         /*!<@brief Selects pin function.: Alternative connection 6. */
#define PIO03_DIGIMODE_DIGITAL 0x01u  /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO03_FUNC_ALT6 0x06u         /*!<@brief Selects pin function.: Alternative connection 6. */
#define PIO04_DIGIMODE_DIGITAL 0x01u  /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO04_FUNC_ALT6 0x06u         /*!<@brief Selects pin function.: Alternative connection 6. */
#define PIO05_DIGIMODE_DIGITAL 0x01u  /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO05_FUNC_ALT6 0x06u         /*!<@brief Selects pin function.: Alternative connection 6. */
#define PIO06_DIGIMODE_DIGITAL 0x01u  /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO06_FUNC_ALT6 0x06u         /*!<@brief Selects pin function.: Alternative connection 6. */
#define PIO07_DIGIMODE_DIGITAL 0x01u  /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO07_FUNC_ALT6 0x06u         /*!<@brief Selects pin function.: Alternative connection 6. */
#define PIO08_DIGIMODE_DIGITAL 0x01u  /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO08_FUNC_ALT6 0x06u         /*!<@brief Selects pin function.: Alternative connection 6. */
#define PIO09_DIGIMODE_DIGITAL 0x01u  /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO09_FUNC_ALT6 0x06u         /*!<@brief Selects pin function.: Alternative connection 6. */
#define PIO110_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO110_FUNC_ALT6 0x06u        /*!<@brief Selects pin function.: Alternative connection 6. */
#define PIO111_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO111_FUNC_ALT6 0x06u        /*!<@brief Selects pin function.: Alternative connection 6. */
#define PIO112_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO112_FUNC_ALT6 0x06u        /*!<@brief Selects pin function.: Alternative connection 6. */
#define PIO113_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO113_FUNC_ALT6 0x06u        /*!<@brief Selects pin function.: Alternative connection 6. */
#define PIO114_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO114_FUNC_ALT6 0x06u        /*!<@brief Selects pin function.: Alternative connection 6. */
#define PIO115_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO115_FUNC_ALT6 0x06u        /*!<@brief Selects pin function.: Alternative connection 6. */
#define PIO116_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO116_FUNC_ALT6 0x06u        /*!<@brief Selects pin function.: Alternative connection 6. */
#define PIO119_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO119_FUNC_ALT6 0x06u        /*!<@brief Selects pin function.: Alternative connection 6. */
#define PIO120_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO120_FUNC_ALT6 0x06u        /*!<@brief Selects pin function.: Alternative connection 6. */
#define PIO121_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO121_FUNC_ALT6 0x06u        /*!<@brief Selects pin function.: Alternative connection 6. */
#define PIO123_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO123_FUNC_ALT6 0x06u        /*!<@brief Selects pin function.: Alternative connection 6. */
#define PIO124_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO124_FUNC_ALT6 0x06u        /*!<@brief Selects pin function.: Alternative connection 6. */
#define PIO125_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO125_FUNC_ALT6 0x06u        /*!<@brief Selects pin function.: Alternative connection 6. */
#define PIO126_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO126_FUNC_ALT6 0x06u        /*!<@brief Selects pin function.: Alternative connection 6. */
#define PIO127_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO127_FUNC_ALT6 0x06u        /*!<@brief Selects pin function.: Alternative connection 6. */
#define PIO128_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO128_FUNC_ALT6 0x06u        /*!<@brief Selects pin function.: Alternative connection 6. */
#define PIO129_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO129_FUNC_ALT6 0x06u        /*!<@brief Selects pin function.: Alternative connection 6. */
#define PIO130_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO130_FUNC_ALT6 0x06u        /*!<@brief Selects pin function.: Alternative connection 6. */
#define PIO131_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO131_FUNC_ALT6 0x06u        /*!<@brief Selects pin function.: Alternative connection 6. */
#define PIO14_DIGIMODE_DIGITAL 0x01u  /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO14_FUNC_ALT6 0x06u         /*!<@brief Selects pin function.: Alternative connection 6. */
#define PIO15_DIGIMODE_DIGITAL 0x01u  /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO15_FUNC_ALT6 0x06u         /*!<@brief Selects pin function.: Alternative connection 6. */
#define PIO16_DIGIMODE_DIGITAL 0x01u  /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO16_FUNC_ALT6 0x06u         /*!<@brief Selects pin function.: Alternative connection 6. */
#define PIO17_DIGIMODE_DIGITAL 0x01u  /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO17_FUNC_ALT6 0x06u         /*!<@brief Selects pin function.: Alternative connection 6. */
#define PIO18_DIGIMODE_DIGITAL 0x01u  /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO18_FUNC_ALT6 0x06u         /*!<@brief Selects pin function.: Alternative connection 6. */
#define PIO19_DIGIMODE_DIGITAL 0x01u  /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO19_FUNC_ALT6 0x06u         /*!<@brief Selects pin function.: Alternative connection 6. */
#define PIO325_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO325_FUNC_ALT6 0x06u        /*!<@brief Selects pin function.: Alternative connection 6. */

/*! @name EMC_A(14) (coord P9), J3[3]/P3_25-EMC_A14
  @{ */
#define BOARD_EMC_A14_PERIPHERAL EMC              /*!<@brief Device name: EMC */
#define BOARD_EMC_A14_SIGNAL EMC_A                /*!<@brief EMC signal: EMC_A */
#define BOARD_EMC_A14_CHANNEL 14                  /*!<@brief EMC EMC_A channel: 14 */
#define BOARD_EMC_A14_PIN_NAME EMC_A(14)          /*!<@brief Pin name */
#define BOARD_EMC_A14_LABEL "J3[3]/P3_25-EMC_A14" /*!<@brief Label */
#define BOARD_EMC_A14_NAME "EMC_A14"              /*!<@brief Identifier name */
                                                  /* @} */

/*! @name EMC_A(13) (coord M12), J3[25]/P1_25-EMC_A13
  @{ */
#define BOARD_EMC_A13_PERIPHERAL EMC               /*!<@brief Device name: EMC */
#define BOARD_EMC_A13_SIGNAL EMC_A                 /*!<@brief EMC signal: EMC_A */
#define BOARD_EMC_A13_CHANNEL 13                   /*!<@brief EMC EMC_A channel: 13 */
#define BOARD_EMC_A13_PIN_NAME EMC_A(13)           /*!<@brief Pin name */
#define BOARD_EMC_A13_LABEL "J3[25]/P1_25-EMC_A13" /*!<@brief Label */
#define BOARD_EMC_A13_NAME "EMC_A13"               /*!<@brief Identifier name */
                                                   /* @} */

/*! @name EMC_A(12) (coord N14), J3[27]/P1_24-EMC_A12
  @{ */
#define BOARD_EMC_A12_PERIPHERAL EMC               /*!<@brief Device name: EMC */
#define BOARD_EMC_A12_SIGNAL EMC_A                 /*!<@brief EMC signal: EMC_A */
#define BOARD_EMC_A12_CHANNEL 12                   /*!<@brief EMC EMC_A channel: 12 */
#define BOARD_EMC_A12_PIN_NAME EMC_A(12)           /*!<@brief Pin name */
#define BOARD_EMC_A12_LABEL "J3[27]/P1_24-EMC_A12" /*!<@brief Label */
#define BOARD_EMC_A12_NAME "EMC_A12"               /*!<@brief Identifier name */
                                                   /* @} */

