EthereumPhone/PQ1/docs/SE050/SE-PLUG-TRUST-MW_04.07.01/demos/ksdk/common/boards/lpc54018iotmodule/se_hostlib_examples/aws_jitr_demo_enet/pin_mux.h
/*! @name EMC_A(11) (coord M10), J3[13]/P1_23-EMC_A11
  @{ */
#define BOARD_EMC_A11_PERIPHERAL EMC               /*!<@brief Device name: EMC */
#define BOARD_EMC_A11_SIGNAL EMC_A                 /*!<@brief EMC signal: EMC_A */
#define BOARD_EMC_A11_CHANNEL 11                   /*!<@brief EMC EMC_A channel: 11 */
#define BOARD_EMC_A11_PIN_NAME EMC_A(11)           /*!<@brief Pin name */
#define BOARD_EMC_A11_LABEL "J3[13]/P1_23-EMC_A11" /*!<@brief Label */
#define BOARD_EMC_A11_NAME "EMC_A11"               /*!<@brief Identifier name */
                                                   /* @} */

/*! @name EMC_A(10) (coord B7), J4[96]/P1_16-EMC_A10
  @{ */
#define BOARD_EMC_A10_PERIPHERAL EMC               /*!<@brief Device name: EMC */
#define BOARD_EMC_A10_SIGNAL EMC_A                 /*!<@brief EMC signal: EMC_A */
#define BOARD_EMC_A10_CHANNEL 10                   /*!<@brief EMC EMC_A channel: 10 */
#define BOARD_EMC_A10_PIN_NAME EMC_A(10)           /*!<@brief Pin name */
#define BOARD_EMC_A10_LABEL "J4[96]/P1_16-EMC_A10" /*!<@brief Label */
#define BOARD_EMC_A10_NAME "EMC_A10"               /*!<@brief Identifier name */
                                                   /* @} */

/*! @name EMC_A(9) (coord F10), J3[55]/P1_27-EMC_A9
  @{ */
#define BOARD_EMC_A9_PERIPHERAL EMC              /*!<@brief Device name: EMC */
#define BOARD_EMC_A9_SIGNAL EMC_A                /*!<@brief EMC signal: EMC_A */
#define BOARD_EMC_A9_CHANNEL 9                   /*!<@brief EMC EMC_A channel: 9 */
#define BOARD_EMC_A9_PIN_NAME EMC_A(9)           /*!<@brief Pin name */
#define BOARD_EMC_A9_LABEL "J3[55]/P1_27-EMC_A9" /*!<@brief Label */
#define BOARD_EMC_A9_NAME "EMC_A9"               /*!<@brief Identifier name */
                                                 /* @} */

/*! @name EMC_A(8) (coord J10), J3[51]/P1_26-EMC_A8
  @{ */
#define BOARD_EMC_A8_PERIPHERAL EMC              /*!<@brief Device name: EMC */
#define BOARD_EMC_A8_SIGNAL EMC_A                /*!<@brief EMC signal: EMC_A */
#define BOARD_EMC_A8_CHANNEL 8                   /*!<@brief EMC EMC_A channel: 8 */
#define BOARD_EMC_A8_PIN_NAME EMC_A(8)           /*!<@brief Pin name */
#define BOARD_EMC_A8_LABEL "J3[51]/P1_26-EMC_A8" /*!<@brief Label */
#define BOARD_EMC_A8_NAME "EMC_A8"               /*!<@brief Identifier name */
                                                 /* @} */

/*! @name EMC_A(7) (coord P8), J4[4]/P1_8-EMC_A7
  @{ */
#define BOARD_EMC_A7_PERIPHERAL EMC            /*!<@brief Device name: EMC */
#define BOARD_EMC_A7_SIGNAL EMC_A              /*!<@brief EMC signal: EMC_A */
#define BOARD_EMC_A7_CHANNEL 7                 /*!<@brief EMC EMC_A channel: 7 */
#define BOARD_EMC_A7_PIN_NAME EMC_A(7)         /*!<@brief Pin name */
#define BOARD_EMC_A7_LABEL "J4[4]/P1_8-EMC_A7" /*!<@brief Label */
#define BOARD_EMC_A7_NAME "EMC_A7"             /*!<@brief Identifier name */
                                               /* @} */

/*! @name EMC_A(6) (coord N1), J4[31]/P1_7-EMC_A6
  @{ */
#define BOARD_EMC_A6_PERIPHERAL EMC             /*!<@brief Device name: EMC */
#define BOARD_EMC_A6_SIGNAL EMC_A               /*!<@brief EMC signal: EMC_A */
#define BOARD_EMC_A6_CHANNEL 6                  /*!<@brief EMC EMC_A channel: 6 */
#define BOARD_EMC_A6_PIN_NAME EMC_A(6)          /*!<@brief Pin name */
#define BOARD_EMC_A6_LABEL "J4[31]/P1_7-EMC_A6" /*!<@brief Label */
#define BOARD_EMC_A6_NAME "EMC_A6"              /*!<@brief Identifier name */
                                                /* @} */

/*! @name EMC_A(5) (coord G4), J4[50]/P1_6-EMC_A5
  @{ */
#define BOARD_EMC_A5_PERIPHERAL EMC             /*!<@brief Device name: EMC */
#define BOARD_EMC_A5_SIGNAL EMC_A               /*!<@brief EMC signal: EMC_A */
#define BOARD_EMC_A5_CHANNEL 5                  /*!<@brief EMC EMC_A channel: 5 */
#define BOARD_EMC_A5_PIN_NAME EMC_A(5)          /*!<@brief Pin name */
#define BOARD_EMC_A5_LABEL "J4[50]/P1_6-EMC_A5" /*!<@brief Label */
#define BOARD_EMC_A5_NAME "EMC_A5"              /*!<@brief Identifier name */
                                                /* @} */

/*! @name EMC_A(4) (coord E4), J4[68]P1_5-EMC_A4
  @{ */
#define BOARD_EMC_A4_PERIPHERAL EMC            /*!<@brief Device name: EMC */
#define BOARD_EMC_A4_SIGNAL EMC_A              /*!<@brief EMC signal: EMC_A */
#define BOARD_EMC_A4_CHANNEL 4                 /*!<@brief EMC EMC_A channel: 4 */
#define BOARD_EMC_A4_PIN_NAME EMC_A(4)         /*!<@brief Pin name */
#define BOARD_EMC_A4_LABEL "J4[68]P1_5-EMC_A4" /*!<@brief Label */
#define BOARD_EMC_A4_NAME "EMC_A4"             /*!<@brief Identifier name */
                                               /* @} */

/*! @name EMC_A(3) (coord C13), J3[54]P0_21-EMC_A3
  @{ */
#define BOARD_EMC_A3_PERIPHERAL EMC             /*!<@brief Device name: EMC */
#define BOARD_EMC_A3_SIGNAL EMC_A               /*!<@brief EMC signal: EMC_A */
#define BOARD_EMC_A3_CHANNEL 3                  /*!<@brief EMC EMC_A channel: 3 */
#define BOARD_EMC_A3_PIN_NAME EMC_A(3)          /*!<@brief Pin name */
#define BOARD_EMC_A3_LABEL "J3[54]P0_21-EMC_A3" /*!<@brief Label */
#define BOARD_EMC_A3_NAME "EMC_A3"              /*!<@brief Identifier name */
                                                /* @} */

/*! @name EMC_A(2) (coord D13), J3[50]/P0_20-EMC_A2
  @{ */
#define BOARD_EMC_A2_PERIPHERAL EMC              /*!<@brief Device name: EMC */
#define BOARD_EMC_A2_SIGNAL EMC_A                /*!<@brief EMC signal: EMC_A */
#define BOARD_EMC_A2_CHANNEL 2                   /*!<@brief EMC EMC_A channel: 2 */
#define BOARD_EMC_A2_PIN_NAME EMC_A(2)           /*!<@brief Pin name */
#define BOARD_EMC_A2_LABEL "J3[50]/P0_20-EMC_A2" /*!<@brief Label */
#define BOARD_EMC_A2_NAME "EMC_A2"               /*!<@brief Identifier name */
                                                 /* @} */

/*! @name EMC_A(1) (coord C6), J4[88]/P0_19-EMC_A1
  @{ */
#define BOARD_EMC_A1_PERIPHERAL EMC              /*!<@brief Device name: EMC */
#define BOARD_EMC_A1_SIGNAL EMC_A                /*!<@brief EMC signal: EMC_A */
#define BOARD_EMC_A1_CHANNEL 1                   /*!<@brief EMC EMC_A channel: 1 */
#define BOARD_EMC_A1_PIN_NAME EMC_A(1)           /*!<@brief Pin name */
#define BOARD_EMC_A1_LABEL "J4[88]/P0_19-EMC_A1" /*!<@brief Label */
#define BOARD_EMC_A1_NAME "EMC_A1"               /*!<@brief Identifier name */
                                                 /* @} */

/*! @name EMC_A(0) (coord C14), J3[52]/P0_18-EMC_A0
  @{ */
#define BOARD_EMC_A0_PERIPHERAL EMC              /*!<@brief Device name: EMC */
#define BOARD_EMC_A0_SIGNAL EMC_A                /*!<@brief EMC signal: EMC_A */
#define BOARD_EMC_A0_CHANNEL 0                   /*!<@brief EMC EMC_A channel: 0 */
#define BOARD_EMC_A0_PIN_NAME EMC_A(0)           /*!<@brief Pin name */
#define BOARD_EMC_A0_LABEL "J3[52]/P0_18-EMC_A0" /*!<@brief Label */
#define BOARD_EMC_A0_NAME "EMC_A0"               /*!<@brief Identifier name */
                                                 /* @} */

/*! @name EMC_WEN (coord L4), J4[46]/P0_15-EMC_WEn
  @{ */
#define BOARD_EMC_WEn_PERIPHERAL EMC               /*!<@brief Device name: EMC */
#define BOARD_EMC_WEn_SIGNAL EMC_WE                /*!<@brief EMC signal: EMC_WE */
#define BOARD_EMC_WEn_PIN_NAME EMC_WEN             /*!<@brief Pin name */
#define BOARD_EMC_WEn_LABEL "J4[46]/P0_15-EMC_WEn" /*!<@brief Label */
#define BOARD_EMC_WEn_NAME "EMC_WEn"               /*!<@brief Identifier name */
                                                   /* @} */

/*! @name EMC_CASN (coord K6), J4[12]/P1_9-EMC_CASn
  @{ */
#define BOARD_EMC_CASn_PERIPHERAL EMC               /*!<@brief Device name: EMC */
#define BOARD_EMC_CASn_SIGNAL EMC_CAS               /*!<@brief EMC signal: EMC_CAS */
#define BOARD_EMC_CASn_PIN_NAME EMC_CASN            /*!<@brief Pin name */
#define BOARD_EMC_CASn_LABEL "J4[12]/P1_9-EMC_CASn" /*!<@brief Label */
#define BOARD_EMC_CASn_NAME "EMC_CASn"              /*!<@brief Identifier name */
                                                    /* @} */

/*! @name EMC_RASN (coord N9), J3[5]/P1_10-EMC_RASn
  @{ */
#define BOARD_EMC_RASn_PERIPHERAL EMC               /*!<@brief Device name: EMC */
#define BOARD_EMC_RASn_SIGNAL EMC_RAS               /*!<@brief EMC signal: EMC_RAS */
#define BOARD_EMC_RASn_PIN_NAME EMC_RASN            /*!<@brief Pin name */
#define BOARD_EMC_RASn_LABEL "J3[5]/P1_10-EMC_RASn" /*!<@brief Label */
#define BOARD_EMC_RASn_NAME "EMC_RASn"              /*!<@brief Identifier name */
                                                    /* @} */

/*! @name EMC_DYCSN(0) (coord K9), J3[7]/P1_12-EMC_DYCSn0
  @{ */
#define BOARD_EMC_DYCSn0_PERIPHERAL EMC                 /*!<@brief Device name: EMC */
#define BOARD_EMC_DYCSn0_SIGNAL EMC_DYCS                /*!<@brief EMC signal: EMC_DYCS */
#define BOARD_EMC_DYCSn0_CHANNEL 0                      /*!<@brief EMC EMC_DYCS channel: 0 */
#define BOARD_EMC_DYCSn0_PIN_NAME EMC_DYCSN(0)          /*!<@brief Pin name */
#define BOARD_EMC_DYCSn0_LABEL "J3[7]/P1_12-EMC_DYCSn0" /*!<@brief Label */
#define BOARD_EMC_DYCSn0_NAME "EMC_DYCSn0"              /*!<@brief Identifier name */
                                                        /* @} */

