EthereumPhone/PQ1/docs/SE050/SE-PLUG-TRUST-MW_04.07.01/demos/ksdk/common/boards/lpc54018iotmodule/se_hostlib_examples/aws_jitr_demo_enet/pin_mux.h
/*! @name EMC_D(15) (coord C5), J4[84]/P1_31-EMC_D15
  @{ */
#define BOARD_EMC_D15_PERIPHERAL EMC               /*!<@brief Device name: EMC */
#define BOARD_EMC_D15_SIGNAL EMC_D                 /*!<@brief EMC signal: EMC_D */
#define BOARD_EMC_D15_CHANNEL 15                   /*!<@brief EMC EMC_D channel: 15 */
#define BOARD_EMC_D15_PIN_NAME EMC_D(15)           /*!<@brief Pin name */
#define BOARD_EMC_D15_LABEL "J4[84]/P1_31-EMC_D15" /*!<@brief Label */
#define BOARD_EMC_D15_NAME "EMC_D15"               /*!<@brief Identifier name */
                                                   /* @} */

/*! @name EMC_D(14) (coord A8), J3[92]/P1_30-EMC_D14
  @{ */
#define BOARD_EMC_D14_PERIPHERAL EMC               /*!<@brief Device name: EMC */
#define BOARD_EMC_D14_SIGNAL EMC_D                 /*!<@brief EMC signal: EMC_D */
#define BOARD_EMC_D14_CHANNEL 14                   /*!<@brief EMC EMC_D channel: 14 */
#define BOARD_EMC_D14_PIN_NAME EMC_D(14)           /*!<@brief Pin name */
#define BOARD_EMC_D14_LABEL "J3[92]/P1_30-EMC_D14" /*!<@brief Label */
#define BOARD_EMC_D14_NAME "EMC_D14"               /*!<@brief Identifier name */
                                                   /* @} */

/*! @name EMC_D(13) (coord C11), J3[85]/P1_29-EMC_D13
  @{ */
#define BOARD_EMC_D13_PERIPHERAL EMC               /*!<@brief Device name: EMC */
#define BOARD_EMC_D13_SIGNAL EMC_D                 /*!<@brief EMC signal: EMC_D */
#define BOARD_EMC_D13_CHANNEL 13                   /*!<@brief EMC EMC_D channel: 13 */
#define BOARD_EMC_D13_PIN_NAME EMC_D(13)           /*!<@brief Pin name */
#define BOARD_EMC_D13_LABEL "J3[85]/P1_29-EMC_D13" /*!<@brief Label */
#define BOARD_EMC_D13_NAME "EMC_D13"               /*!<@brief Identifier name */
                                                   /* @} */

/*! @name EMC_D(12) (coord E12), J3[77]/P1_28-EMC_D12
  @{ */
#define BOARD_EMC_D12_PERIPHERAL EMC               /*!<@brief Device name: EMC */
#define BOARD_EMC_D12_SIGNAL EMC_D                 /*!<@brief EMC signal: EMC_D */
#define BOARD_EMC_D12_CHANNEL 12                   /*!<@brief EMC EMC_D channel: 12 */
#define BOARD_EMC_D12_PIN_NAME EMC_D(12)           /*!<@brief Pin name */
#define BOARD_EMC_D12_LABEL "J3[77]/P1_28-EMC_D12" /*!<@brief Label */
#define BOARD_EMC_D12_NAME "EMC_D12"               /*!<@brief Identifier name */
                                                   /* @} */

/*! @name EMC_D(11) (coord D4), J4[74]/P1_4-EMC_D11
  @{ */
#define BOARD_EMC_D11_PERIPHERAL EMC              /*!<@brief Device name: EMC */
#define BOARD_EMC_D11_SIGNAL EMC_D                /*!<@brief EMC signal: EMC_D */
#define BOARD_EMC_D11_CHANNEL 11                  /*!<@brief EMC EMC_D channel: 11 */
#define BOARD_EMC_D11_PIN_NAME EMC_D(11)          /*!<@brief Pin name */
#define BOARD_EMC_D11_LABEL "J4[74]/P1_4-EMC_D11" /*!<@brief Label */
#define BOARD_EMC_D11_NAME "EMC_D11"              /*!<@brief Identifier name */
                                                  /* @} */

/*! @name EMC_D(10) (coord N8), J4[6]/P1_21-EMC_D10
  @{ */
#define BOARD_EMC_D10_PERIPHERAL EMC              /*!<@brief Device name: EMC */
#define BOARD_EMC_D10_SIGNAL EMC_D                /*!<@brief EMC signal: EMC_D */
#define BOARD_EMC_D10_CHANNEL 10                  /*!<@brief EMC EMC_D channel: 10 */
#define BOARD_EMC_D10_PIN_NAME EMC_D(10)          /*!<@brief Pin name */
#define BOARD_EMC_D10_LABEL "J4[6]/P1_21-EMC_D10" /*!<@brief Label */
#define BOARD_EMC_D10_NAME "EMC_D10"              /*!<@brief Identifier name */
                                                  /* @} */

/*! @name EMC_D(9) (coord M1), J4[33]/P1_20-EMC_D9
  @{ */
#define BOARD_EMC_D9_PERIPHERAL EMC              /*!<@brief Device name: EMC */
#define BOARD_EMC_D9_SIGNAL EMC_D                /*!<@brief EMC signal: EMC_D */
#define BOARD_EMC_D9_CHANNEL 9                   /*!<@brief EMC EMC_D channel: 9 */
#define BOARD_EMC_D9_PIN_NAME EMC_D(9)           /*!<@brief Pin name */
#define BOARD_EMC_D9_LABEL "J4[33]/P1_20-EMC_D9" /*!<@brief Label */
#define BOARD_EMC_D9_NAME "EMC_D9"               /*!<@brief Identifier name */
                                                 /* @} */

/*! @name EMC_D(8) (coord L1), J4[35]/P1_19-EMC_D8
  @{ */
#define BOARD_EMC_D8_PERIPHERAL EMC              /*!<@brief Device name: EMC */
#define BOARD_EMC_D8_SIGNAL EMC_D                /*!<@brief EMC signal: EMC_D */
#define BOARD_EMC_D8_CHANNEL 8                   /*!<@brief EMC EMC_D channel: 8 */
#define BOARD_EMC_D8_PIN_NAME EMC_D(8)           /*!<@brief Pin name */
#define BOARD_EMC_D8_LABEL "J4[35]/P1_19-EMC_D8" /*!<@brief Label */
#define BOARD_EMC_D8_NAME "EMC_D8"               /*!<@brief Identifier name */
                                                 /* @} */

/*! @name EMC_D(7) (coord G12), J3[57]/P0_9-EMC_D7
  @{ */
#define BOARD_EMC_D7_PERIPHERAL EMC             /*!<@brief Device name: EMC */
#define BOARD_EMC_D7_SIGNAL EMC_D               /*!<@brief EMC signal: EMC_D */
#define BOARD_EMC_D7_CHANNEL 7                  /*!<@brief EMC EMC_D channel: 7 */
#define BOARD_EMC_D7_PIN_NAME EMC_D(7)          /*!<@brief Pin name */
#define BOARD_EMC_D7_LABEL "J3[57]/P0_9-EMC_D7" /*!<@brief Label */
#define BOARD_EMC_D7_NAME "EMC_D7"              /*!<@brief Identifier name */
                                                /* @} */

/*! @name EMC_D(6) (coord H10), J3[36]/P0_8-EMC_D6
  @{ */
#define BOARD_EMC_D6_PERIPHERAL EMC             /*!<@brief Device name: EMC */
#define BOARD_EMC_D6_SIGNAL EMC_D               /*!<@brief EMC signal: EMC_D */
#define BOARD_EMC_D6_CHANNEL 6                  /*!<@brief EMC EMC_D channel: 6 */
#define BOARD_EMC_D6_PIN_NAME EMC_D(6)          /*!<@brief Pin name */
#define BOARD_EMC_D6_LABEL "J3[36]/P0_8-EMC_D6" /*!<@brief Label */
#define BOARD_EMC_D6_NAME "EMC_D6"              /*!<@brief Identifier name */
                                                /* @} */

/*! @name EMC_D(5) (coord H12), J3[49]P0_7-EMC_D5
  @{ */
#define BOARD_EMC_D5_PERIPHERAL EMC            /*!<@brief Device name: EMC */
#define BOARD_EMC_D5_SIGNAL EMC_D              /*!<@brief EMC signal: EMC_D */
#define BOARD_EMC_D5_CHANNEL 5                 /*!<@brief EMC EMC_D channel: 5 */
#define BOARD_EMC_D5_PIN_NAME EMC_D(5)         /*!<@brief Pin name */
#define BOARD_EMC_D5_LABEL "J3[49]P0_7-EMC_D5" /*!<@brief Label */
#define BOARD_EMC_D5_NAME "EMC_D5"             /*!<@brief Identifier name */
                                               /* @} */

/*! @name EMC_D(4) (coord A5), J3[96]/P0_6-EMC_D4
  @{ */
#define BOARD_EMC_D4_PERIPHERAL EMC             /*!<@brief Device name: EMC */
#define BOARD_EMC_D4_SIGNAL EMC_D               /*!<@brief EMC signal: EMC_D */
#define BOARD_EMC_D4_CHANNEL 4                  /*!<@brief EMC EMC_D channel: 4 */
#define BOARD_EMC_D4_PIN_NAME EMC_D(4)          /*!<@brief Pin name */
#define BOARD_EMC_D4_LABEL "J3[96]/P0_6-EMC_D4" /*!<@brief Label */
#define BOARD_EMC_D4_NAME "EMC_D4"              /*!<@brief Identifier name */
                                                /* @} */

/*! @name EMC_D(3) (coord E7), J3[92]/P0_5-EMC_D3
  @{ */
#define BOARD_EMC_D3_PERIPHERAL EMC             /*!<@brief Device name: EMC */
#define BOARD_EMC_D3_SIGNAL EMC_D               /*!<@brief EMC signal: EMC_D */
#define BOARD_EMC_D3_CHANNEL 3                  /*!<@brief EMC EMC_D channel: 3 */
#define BOARD_EMC_D3_PIN_NAME EMC_D(3)          /*!<@brief Pin name */
#define BOARD_EMC_D3_LABEL "J3[92]/P0_5-EMC_D3" /*!<@brief Label */
#define BOARD_EMC_D3_NAME "EMC_D3"              /*!<@brief Identifier name */
                                                /* @} */

/*! @name EMC_D(2) (coord C8), J3[94]/P0_4-EMC_D2
  @{ */
#define BOARD_EMC_D2_PERIPHERAL EMC             /*!<@brief Device name: EMC */
#define BOARD_EMC_D2_SIGNAL EMC_D               /*!<@brief EMC signal: EMC_D */
#define BOARD_EMC_D2_CHANNEL 2                  /*!<@brief EMC EMC_D channel: 2 */
#define BOARD_EMC_D2_PIN_NAME EMC_D(2)          /*!<@brief Pin name */
#define BOARD_EMC_D2_LABEL "J3[94]/P0_4-EMC_D2" /*!<@brief Label */
#define BOARD_EMC_D2_NAME "EMC_D2"              /*!<@brief Identifier name */
                                                /* @} */

/*! @name EMC_D(1) (coord A10), J3[70]P0_3-ISP_FC3_MOSI-EMC_D1
  @{ */
#define BOARD_EMC_D1_PERIPHERAL EMC                         /*!<@brief Device name: EMC */
#define BOARD_EMC_D1_SIGNAL EMC_D                           /*!<@brief EMC signal: EMC_D */
#define BOARD_EMC_D1_CHANNEL 1                              /*!<@brief EMC EMC_D channel: 1 */
#define BOARD_EMC_D1_PIN_NAME EMC_D(1)                      /*!<@brief Pin name */
#define BOARD_EMC_D1_LABEL "J3[70]P0_3-ISP_FC3_MOSI-EMC_D1" /*!<@brief Label */
#define BOARD_EMC_D1_NAME "EMC_D1"                          /*!<@brief Identifier name */
                                                            /* @} */

