EthereumPhone/PQ1/docs/SE050/SE-PLUG-TRUST-MW_04.07.01/demos/ksdk/common/boards/lpc54018iotmodule/se_hostlib_examples/aws_jitr_demo_enet/pin_mux.h
/*! @name EMC_D(0) (coord E9), J3[97]/P0_2-ISP_FC3_MISO-EMC_D0
  @{ */
#define BOARD_EMC_D0_PERIPHERAL EMC                          /*!<@brief Device name: EMC */
#define BOARD_EMC_D0_SIGNAL EMC_D                            /*!<@brief EMC signal: EMC_D */
#define BOARD_EMC_D0_CHANNEL 0                               /*!<@brief EMC EMC_D channel: 0 */
#define BOARD_EMC_D0_PIN_NAME EMC_D(0)                       /*!<@brief Pin name */
#define BOARD_EMC_D0_LABEL "J3[97]/P0_2-ISP_FC3_MISO-EMC_D0" /*!<@brief Label */
#define BOARD_EMC_D0_NAME "EMC_D0"                           /*!<@brief Identifier name */
                                                             /* @} */

/*! @name EMC_DQM(1) (coord C12), J3[83]/P1_14-EMC_DQM1
  @{ */
#define BOARD_EMC_DQM1_PERIPHERAL EMC                /*!<@brief Device name: EMC */
#define BOARD_EMC_DQM1_SIGNAL EMC_DQM                /*!<@brief EMC signal: EMC_DQM */
#define BOARD_EMC_DQM1_CHANNEL 1                     /*!<@brief EMC EMC_DQM channel: 1 */
#define BOARD_EMC_DQM1_PIN_NAME EMC_DQM(1)           /*!<@brief Pin name */
#define BOARD_EMC_DQM1_LABEL "J3[83]/P1_14-EMC_DQM1" /*!<@brief Label */
#define BOARD_EMC_DQM1_NAME "EMC_DQM1"               /*!<@brief Identifier name */
                                                     /* @} */

/*! @name EMC_DQM(0) (coord G10), J3[53]/P1_13-EMC_DQM0
  @{ */
#define BOARD_EMC_DQM0_PERIPHERAL EMC                /*!<@brief Device name: EMC */
#define BOARD_EMC_DQM0_SIGNAL EMC_DQM                /*!<@brief EMC signal: EMC_DQM */
#define BOARD_EMC_DQM0_CHANNEL 0                     /*!<@brief EMC EMC_DQM channel: 0 */
#define BOARD_EMC_DQM0_PIN_NAME EMC_DQM(0)           /*!<@brief Pin name */
#define BOARD_EMC_DQM0_LABEL "J3[53]/P1_13-EMC_DQM0" /*!<@brief Label */
#define BOARD_EMC_DQM0_NAME "EMC_DQM0"               /*!<@brief Identifier name */
                                                     /* @} */

/*! @name EMC_CLK(0) (coord B4), J4[94]/P1_11-EMC_CLK0
  @{ */
#define BOARD_EMC_CLK0_PERIPHERAL EMC                /*!<@brief Device name: EMC */
#define BOARD_EMC_CLK0_SIGNAL EMC_CLK                /*!<@brief EMC signal: EMC_CLK */
#define BOARD_EMC_CLK0_CHANNEL 0                     /*!<@brief EMC EMC_CLK channel: 0 */
#define BOARD_EMC_CLK0_PIN_NAME EMC_CLK(0)           /*!<@brief Pin name */
#define BOARD_EMC_CLK0_LABEL "J4[94]/P1_11-EMC_CLK0" /*!<@brief Label */
#define BOARD_EMC_CLK0_NAME "EMC_CLK0"               /*!<@brief Identifier name */
                                                     /* @} */

/*! @name EMC_CKE(0) (coord A11), J3[73]/P1_15-EMC_CKE0
  @{ */
#define BOARD_EMC_CKE0_PERIPHERAL EMC                /*!<@brief Device name: EMC */
#define BOARD_EMC_CKE0_SIGNAL EMC_CKE                /*!<@brief EMC signal: EMC_CKE */
#define BOARD_EMC_CKE0_CHANNEL 0                     /*!<@brief EMC EMC_CKE channel: 0 */
#define BOARD_EMC_CKE0_PIN_NAME EMC_CKE(0)           /*!<@brief Pin name */
#define BOARD_EMC_CKE0_LABEL "J3[73]/P1_15-EMC_CKE0" /*!<@brief Label */
#define BOARD_EMC_CKE0_NAME "EMC_CKE0"               /*!<@brief Identifier name */
                                                     /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitSDRAM(void); /* Function assigned for the Cortex-M4F */

#define PIO029_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO029_FUNC_ALT1 0x01u        /*!<@brief Selects pin function.: Alternative connection 1. */
#define PIO030_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO030_FUNC_ALT1 0x01u        /*!<@brief Selects pin function.: Alternative connection 1. */

/*! @name FC0_RXD_SDA_MOSI (coord B13), J4[97]/P0_29-ISP_FC0_RXD
  @{ */
#define BOARD_ISP_FC0_RXD_PERIPHERAL FLEXCOMM0              /*!<@brief Device name: FLEXCOMM0 */
#define BOARD_ISP_FC0_RXD_SIGNAL RXD_SDA_MOSI               /*!<@brief FLEXCOMM0 signal: RXD_SDA_MOSI */
#define BOARD_ISP_FC0_RXD_PIN_NAME FC0_RXD_SDA_MOSI         /*!<@brief Pin name */
#define BOARD_ISP_FC0_RXD_LABEL "J4[97]/P0_29-ISP_FC0_RXD"  /*!<@brief Label */
#define BOARD_ISP_FC0_RXD_NAME "ISP_FC0_RXD"                /*!<@brief Identifier name */
#define BOARD_ISP_FC0_RXD_DIRECTION kPIN_MUX_DirectionInput /*!<@brief Direction */
                                                            /* @} */

/*! @name FC0_TXD_SCL_MISO (coord A2), J4[93]/P0_30-ISP_FC0_TXD
  @{ */
#define BOARD_ISP_FC0_TXD_PERIPHERAL FLEXCOMM0               /*!<@brief Device name: FLEXCOMM0 */
#define BOARD_ISP_FC0_TXD_SIGNAL TXD_SCL_MISO                /*!<@brief FLEXCOMM0 signal: TXD_SCL_MISO */
#define BOARD_ISP_FC0_TXD_PIN_NAME FC0_TXD_SCL_MISO          /*!<@brief Pin name */
#define BOARD_ISP_FC0_TXD_LABEL "J4[93]/P0_30-ISP_FC0_TXD"   /*!<@brief Label */
#define BOARD_ISP_FC0_TXD_NAME "ISP_FC0_TXD"                 /*!<@brief Identifier name */
#define BOARD_ISP_FC0_TXD_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */
                                                             /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitDEBUG_UART(void); /* Function assigned for the Cortex-M4F */

#define PIO010_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO010_FUNC_ALT6 0x06u        /*!<@brief Selects pin function.: Alternative connection 6. */
#define PIO011_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO011_FUNC_ALT6 0x06u        /*!<@brief Selects pin function.: Alternative connection 6. */
#define PIO012_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO012_FUNC_ALT6 0x06u        /*!<@brief Selects pin function.: Alternative connection 6. */

/*! @name SWDIO (coord M3), J4[32]/J7[4]/IF_SWDIO
  @{ */
#define BOARD_IF_SWDIO_PERIPHERAL SWD                /*!<@brief Device name: SWD */
#define BOARD_IF_SWDIO_SIGNAL SWDIO                  /*!<@brief SWD signal: SWDIO */
#define BOARD_IF_SWDIO_PIN_NAME SWDIO                /*!<@brief Pin name */
#define BOARD_IF_SWDIO_LABEL "J4[32]/J7[4]/IF_SWDIO" /*!<@brief Label */
#define BOARD_IF_SWDIO_NAME "IF_SWDIO"               /*!<@brief Identifier name */
                                                     /* @} */

/*! @name SWCLK (coord L3), J4[34]/J7[4]/SWDCLK_TRGT
  @{ */
#define BOARD_SWDCLK_TRGT_PERIPHERAL SWD                   /*!<@brief Device name: SWD */
#define BOARD_SWDCLK_TRGT_SIGNAL SWCLK                     /*!<@brief SWD signal: SWCLK */
#define BOARD_SWDCLK_TRGT_PIN_NAME SWCLK                   /*!<@brief Pin name */
#define BOARD_SWDCLK_TRGT_LABEL "J4[34]/J7[4]/SWDCLK_TRGT" /*!<@brief Label */
#define BOARD_SWDCLK_TRGT_NAME "SWDCLK_TRGT"               /*!<@brief Identifier name */
                                                           /* @} */

/*! @name SWO (coord P2), J4[27]/J7[6]/SWO_TRGT
  @{ */
#define BOARD_SWO_TRGT_PERIPHERAL SWD                /*!<@brief Device name: SWD */
#define BOARD_SWO_TRGT_SIGNAL SWO                    /*!<@brief SWD signal: SWO */
#define BOARD_SWO_TRGT_PIN_NAME SWO                  /*!<@brief Pin name */
#define BOARD_SWO_TRGT_LABEL "J4[27]/J7[6]/SWO_TRGT" /*!<@brief Label */
#define BOARD_SWO_TRGT_NAME "SWO_TRGT"               /*!<@brief Identifier name */
                                                     /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitSWD_DEBUG(void); /* Function assigned for the Cortex-M4F */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
